
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Introduction · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-vuejs/vue.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="basic.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                
<script async type="text/javascript" src="//cdn.carbonads.com/carbon.js?zoneid=1673&serve=C6AILKT&placement=vuejs" id="_carbonads_js"></script>




<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="basic.html">
            
                <a href="basic.html">
            
                    
                    기본 사용 방법
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="universal.html">
            
                <a href="universal.html">
            
                    
                    유니버설 코드 작성하기
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="structure.html">
            
                <a href="structure.html">
            
                    
                    소스코드 구조
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="routing.html">
            
                <a href="routing.html">
            
                    
                    라우팅과 코드 분할
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="data.md">
            
                <span>
            
                    
                    데이터 프리페치와 state(상태)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="hydration.html">
            
                <a href="hydration.html">
            
                    
                    클라이언트 사이드 하이드레이션
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="bundle-renderer.html">
            
                <a href="bundle-renderer.html">
            
                    
                    번들 렌더러 소개
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="build-config.html">
            
                <a href="build-config.html">
            
                    
                    빌드 설정
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="css.md">
            
                <span>
            
                    
                    CSS 관리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="head.html">
            
                <a href="head.html">
            
                    
                    Head 관리
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="caching.html">
            
                <a href="caching.html">
            
                    
                    캐싱
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="streaming.html">
            
                <a href="streaming.html">
            
                    
                    스트리밍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="api.html">
            
                <a href="api.html">
            
                    
                    API 참조
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.14.1" data-path="api.html">
            
                <a href="api.html#createrendereroptions">
            
                    
                    createRenderer
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.2" data-path="api.html">
            
                <a href="api.html#createbundlerendererbundle-options">
            
                    
                    createBundleRenderer
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.3" data-path="api.html">
            
                <a href="api.html#class-renderer">
            
                    
                    Class: Renderer
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.4" data-path="api.html">
            
                <a href="api.html#class-bundlerenderer">
            
                    
                    Class: BundleRenderer
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.5" data-path="api.html">
            
                <a href="api.html#renderer-options">
            
                    
                    렌더러 옵션
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.6" data-path="api.html">
            
                <a href="api.html#template">
            
                    
                    template
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.7" data-path="api.html">
            
                <a href="api.html#clientmanifest">
            
                    
                    clientManifest
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.8" data-path="api.html">
            
                <a href="api.html#inject">
            
                    
                    inject
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.9" data-path="api.html">
            
                <a href="api.html#shouldpreload">
            
                    
                    shouldPreload
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.10" data-path="api.html">
            
                <a href="api.html#runinnewcontext">
            
                    
                    runInNewContext
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.11" data-path="api.html">
            
                <a href="api.html#basedir">
            
                    
                    basedir
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.12" data-path="api.html">
            
                <a href="api.html#cache">
            
                    
                    cache
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.13" data-path="api.html">
            
                <a href="api.html#directives">
            
                    
                    directives
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14.14" data-path="api.html">
            
                <a href="api.html#webpack-plugins">
            
                    
                    webpack Plugins
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>



                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
  
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Introduction</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="vuejs-&#xC11C;&#xBC84;-&#xC0AC;&#xC774;&#xB4DC;-&#xB80C;&#xB354;&#xB9C1;-&#xAC00;&#xC774;&#xB4DC;">Vue.js &#xC11C;&#xBC84; &#xC0AC;&#xC774;&#xB4DC; &#xB80C;&#xB354;&#xB9C1; &#xAC00;&#xC774;&#xB4DC;</h1>
<blockquote>
<p><strong>&#xCC38;&#xACE0;&#xC0AC;&#xD56D;:</strong> &#xC774; &#xAC00;&#xC774;&#xB4DC;&#xB294; &#xC544;&#xB798;&#xC5D0; &#xD45C;&#xAE30;&#xB41C; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB4E4;&#xC758; &#xCD5C;&#xC18C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC744; &#xD544;&#xC694;&#xB85C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>vue &amp; vue-server-renderer &gt;= 2.3.0</li>
<li>vue-router &gt;= 2.5.0</li>
<li>vue-loader &gt;= 12.0.0 &amp; vue-style-loader &gt;= 3.0.0</li>
</ul>
</blockquote>
<p>Vue 2.2 &#xBC84;&#xC804;&#xACFC; &#xD568;&#xAED8; SSR&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xACE0; &#xC788;&#xB2E4;&#xBA74; &#xAD8C;&#xC7A5;&#xD558;&#xB294; &#xCF54;&#xB4DC; &#xAD6C;&#xC870;&#xAC00; <a href="structure.html">&#xC57D;&#xAC04; &#xB2E4;&#xB985;&#xB2C8;&#xB2E4;.</a> (<a href="api.html#runinnewcontext">runInNewContext</a>&#xC774; <code>false</code>&#xB85C; &#xC124;&#xC815;&#xB428;) &#xAE30;&#xC874; &#xC571;&#xC744; &#xC0AC;&#xC6A9;&#xD574;&#xC57C; &#xD558;&#xB294; &#xAC83;&#xC774; &#xB9DE;&#xC9C0;&#xB9CC; &#xC0C8;&#xB85C;&#xC6B4; &#xAD8C;&#xC7A5; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xB9C8;&#xC774;&#xADF8;&#xB808;&#xC774;&#xC158; &#xD558;&#xB294; &#xAC83;&#xC774; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC11C;&#xBC84;&#xC0AC;&#xC774;&#xB4DC;-&#xB80C;&#xB354;&#xB9C1;ssr&#xC774;&#xB780;-&#xBB34;&#xC5C7;&#xC785;&#xB2C8;&#xAE4C;">&#xC11C;&#xBC84;&#xC0AC;&#xC774;&#xB4DC; &#xB80C;&#xB354;&#xB9C1;(SSR)&#xC774;&#xB780; &#xBB34;&#xC5C7;&#xC785;&#xB2C8;&#xAE4C;?</h2>
<p>Vue.js&#xB294; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xCE21; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC744; &#xC704;&#xD55C; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;&#xC785;&#xB2C8;&#xB2E4;. &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; Vue &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB294; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC5D0;&#xC11C; DOM&#xC744; &#xC0DD;&#xC131; &#xBC0F; &#xC870;&#xC791; &#xD6C4; &#xCD9C;&#xB825;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xB3D9;&#xC77C;&#xD55C; &#xCEF4;&#xD3EC;&#xB10C;&#xD2B8;&#xB97C; &#xC11C;&#xBC84;&#xC758; HTML &#xBB38;&#xC790;&#xC5F4;&#xB85C; &#xB80C;&#xB354;&#xB9C1;&#xD55C; &#xD6C4; &#xC9C1;&#xC811; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB85C; &#xBCF4;&#xB0B4;&#xACE0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xC815;&#xC801; &#xB9C8;&#xD06C;&#xC5C5;&#xC744; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC758; &#xC0C1;&#xD638;&#xC791;&#xC6A9;&#xD558;&#xB294; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC73C;&#xB85C;  &quot;hydrate&quot; &#xD558;&#xB294; &#xAC83;&#xB3C4; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xB80C;&#xB354;&#xB9C1;&#xB41C; Vue.js &#xC571;&#xC740; &#xCF54;&#xB4DC; &#xB300;&#xBD80;&#xBD84;&#xC774; &#xC11C;&#xBC84;&#xC640; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8; &#xBAA8;&#xB450;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD558;&#xB294; &#xC810;&#xC5D0;&#xC11C; &quot;&#xAC19;&#xC740; &#xD615;&#xD0DC;&quot; <strong>&#xC774;&#xBA70;</strong> &quot;&#xBC94;&#xC6A9;&#xC801;&quot;&#xC73C;&#xB85C; &#xC5EC;&#xACA8;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC65C;-ssr&#xC744;-&#xC0AC;&#xC6A9;&#xD558;&#xB098;&#xC694;">&#xC65C; SSR&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB098;&#xC694;?</h2>
<p>&#xC804;&#xD1B5;&#xC801;&#xC778; SPA(&#xC2F1;&#xAE00; &#xD398;&#xC774;&#xC9C0; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;)&#xC5D0; &#xBE44;&#xD574; SSR&#xC758; &#xC7A5;&#xC810;&#xC740; &#xC8FC;&#xB85C; &#xC544;&#xB798;&#xC5D0; &#xC788;&#xB294; &#xB0B4;&#xC6A9;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li><p>&#xAC80;&#xC0C9; &#xC5D4;&#xC9C4; &#xD06C;&#xB864;&#xB7EC;&#xB294; &#xC644;&#xC804;&#xD788; &#xB80C;&#xB354;&#xB9C1; &#xB41C; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xC9C1;&#xC811; &#xBCFC; &#xC218; &#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xAC80;&#xC0C9; &#xC5D4;&#xC9C4; &#xCD5C;&#xC801;&#xD654;&#xAC00; &#xAC1C;&#xC120;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p>&#xD604;&#xC7AC; Google&#xACFC; Bing&#xC740; &#xB3D9;&#xAE30;&#xC2DD; &#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xC778;&#xB371;&#xC2F1;&#xC744; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xB3D9;&#xAE30;&#xC2DD;&#xC774; &#xD575;&#xC2EC; &#xB2E8;&#xC5B4;&#xC785;&#xB2C8;&#xB2E4;. &#xC571;&#xC774; &#xB85C;&#xB529; &#xC2A4;&#xD53C;&#xB108;&#xB85C; &#xC2DC;&#xC791;&#xD55C; &#xB2E4;&#xC74C; Ajax&#xB97C; &#xC774;&#xC6A9;&#xD574; &#xCEE8;&#xD150;&#xCE20;&#xB97C; &#xAC00;&#xC838;&#xC624;&#xB294; &#xACBD;&#xC6B0; &#xD06C;&#xB864;&#xB7EC;&#xAC00; &#xC644;&#xB8CC;&#xB420; &#xB54C;&#xAE4C;&#xC9C0; &#xAE30;&#xB2E4;&#xB9AC;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC989;, SEO&#xAC00; &#xC911;&#xC694;&#xD55C; &#xD398;&#xC774;&#xC9C0;&#xC5D0;&#xC11C; &#xBE44;&#xB3D9;&#xAE30;&#xC801;&#xC73C;&#xB85C; &#xCF58;&#xD150;&#xCE20;&#xB97C; &#xAC00;&#xC838;&#xC624;&#xB294; &#xACBD;&#xC6B0; SSR&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</p>
</li>
<li><p>&#xCEE8;&#xD150;&#xCE20; &#xB3C4;&#xB2EC; &#xC2DC;&#xAC04; &#xB2E8;&#xCD95;, &#xD2B9;&#xD788; &#xB290;&#xB9B0; &#xC778;&#xD130;&#xB137; &#xB610;&#xB294; &#xB290;&#xB9B0; &#xC7A5;&#xCE58;&#xC758; &#xACBD;&#xC6B0;&#xC5D0; &#xC11C;&#xBC84; &#xB80C;&#xB354;&#xB9C1; &#xB9C8;&#xD06C;&#xC5C5;&#xC740; &#xBAA8;&#xB4E0; &#xC790;&#xBC14; &#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xAC00; &#xB2E4;&#xC6B4;&#xB85C;&#xB4DC;&#xB418;&#xC5B4; &#xC2E4;&#xD589;&#xB420; &#xB54C;&#xAE4C;&#xC9C0; &#xAE30;&#xB2E4;&#xB9B4; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xC73C;&#xBBC0;&#xB85C; &#xC0AC;&#xC6A9;&#xC790;&#xB294; &#xC644;&#xC804;&#xD788; &#xB80C;&#xB354;&#xB9C1; &#xB41C; &#xD398;&#xC774;&#xC9C0;&#xB97C; &#xB354; &#xBE68;&#xB9AC; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xC790; &#xACBD;&#xD5D8;&#xC774; &#xD5A5;&#xC0C1;&#xB418;&#xACE0; &#xC804;&#xD658;&#xC728;&#xACFC; &#xC9C1;&#xC811;&#xC801;&#xC778; &#xAD00;&#xB828;&#xC131;&#xC774;&#xC788;&#xB294; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xACBD;&#xC6B0; &#xC911;&#xC694;&#xD574;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
</li>
</ul>
<p>&#xD558;&#xC9C0;&#xB9CC; SSR&#xC744; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; &#xACE0;&#xB824;&#xD574;&#xC57C;&#xD560; &#xBA87;&#xAC00;&#xC9C0; &#xB2E8;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xAC1C;&#xBC1C; &#xC81C;&#xC57D; &#xC0AC;&#xD56D;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xC758; &#xD2B9;&#xC815; &#xCF54;&#xB4DC;&#xB294; &#xD2B9;&#xC815;&#xD55C; &#xB77C;&#xC774;&#xD504;&#xC0AC;&#xC774;&#xD074;&#xC5D0;&#xC11C;&#xB9CC; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xBD80; &#xC678;&#xBD80; &#xB77C;&#xC774;&#xBE0C;&#xB7EC;&#xB9AC;&#xB294; &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xB80C;&#xB354;&#xB9C1; &#xB41C; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xCC98;&#xB9AC;&#xAC00; &#xD544;&#xC694;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xC124;&#xCE58; &#xBC0F; &#xBC30;&#xD3EC; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC744; &#xBCF4;&#xB2E4; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC815;&#xC801; &#xD30C;&#xC77C; &#xC11C;&#xBC84;&#xC5D0; &#xBC30;&#xD3EC;&#xD560; &#xC218; &#xC788;&#xB294; &#xC644;&#xC804;&#xD788; &#xC815;&#xC801;&#xC778; SPA&#xC640; &#xB2EC;&#xB9AC; &#xC11C;&#xBC84; &#xC0AC;&#xC774;&#xB4DC; &#xB80C;&#xB354;&#xB9C1; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C;&#xB294; Node.js &#xC11C;&#xBC84;&#xB97C; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xB294; &#xD658;&#xACBD;&#xC774; &#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xB354; &#xB9CE;&#xC740; &#xC11C;&#xBC84;&#xCE21; &#xBD80;&#xD558;&#xAC00; &#xC0DD;&#xAE41;&#xB2C8;&#xB2E4;. Node.js&#xC758; &#xC804;&#xCCB4; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xB80C;&#xB354;&#xB9C1;&#xC740; &#xC815;&#xC801; &#xD30C;&#xC77C;&#xC744; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAC83; &#xBCF4;&#xB2E4; CPU&#xB97C; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xBBC0;&#xB85C; &#xD2B8;&#xB798;&#xD53D;&#xC774; &#xB9CE;&#xC744; &#xAC83;&#xC73C;&#xB85C; &#xC608;&#xC0C1;&#xB418;&#xBA74; &#xC11C;&#xBC84; &#xBD80;&#xD558;&#xC5D0; &#xB300;&#xBE44;&#xD558;&#xACE0; &#xCE90;&#xC2F1; &#xC804;&#xB7B5;&#xC744; &#xC798; &#xC9DC;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;.</li>
</ul>
<p>&#xC571;&#xC5D0; SSR&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xC804;&#xC5D0; &#xBA3C;&#xC800; &#xC2E4;&#xC81C; &#xD544;&#xC694;&#xD55C;&#xC9C0; &#xACE0;&#xBBFC;&#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xBCF4;&#xD1B5; &#xC571;&#xC758; &#xCEE8;&#xD150;&#xCE20;&#xAC00; &#xC5BC;&#xB9C8;&#xB098; &#xBE68;&#xB9AC; &#xB3C4;&#xB2EC;&#xD574;&#xC57C; &#xD558;&#xB294;&#xC9C0;&#xC5D0; &#xB2EC;&#xB824; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4;, &#xCD08;&#xAE30; &#xB85C;&#xB4DC; &#xC2DC; &#xCD94;&#xAC00;&#xC801;&#xC778; &#xC218;&#xBC31; &#xBC00;&#xB9AC; &#xCD08;&#xAC00; &#xADF8;&#xB2E4;&#xC9C0; &#xC911;&#xC694;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xB0B4;&#xBD80; &#xB300;&#xC2DC; &#xBCF4;&#xB4DC;&#xB97C; &#xAD6C;&#xCD95;&#xD558;&#xB294; &#xACBD;&#xC6B0; SSR&#xC740; &#xBD88;&#xD544;&#xC694;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC2DC;&#xAC04;&#xC5D0; &#xB530;&#xB978; &#xCEE8;&#xD150;&#xCE20;&#xAC00; &#xC808;&#xB300;&#xC801;&#xC73C;&#xB85C; &#xC911;&#xC694;&#xD55C; &#xACBD;&#xC6B0; SSR&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xCD5C;&#xC0C1;&#xC758; &#xCD08;&#xAE30; &#xB85C;&#xB4DC; &#xC131;&#xB2A5;&#xC744; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC11C;&#xBC84;-&#xC0AC;&#xC774;&#xB4DC;-&#xB80C;&#xB354;&#xB9C1;-vs-&#xC0AC;&#xC804;-&#xB80C;&#xB354;&#xB9C1;">&#xC11C;&#xBC84; &#xC0AC;&#xC774;&#xB4DC; &#xB80C;&#xB354;&#xB9C1; vs &#xC0AC;&#xC804; &#xB80C;&#xB354;&#xB9C1;</h2>
<p>&#xBA87; &#xAC00;&#xC9C0; &#xB9C8;&#xCF00;&#xD305; &#xD398;&#xC774;&#xC9C0; (&#xC608; : <code>/</code>, <code>/about</code>, <code>/contact</code> &#xB4F1;)&#xC758; &#xAC80;&#xC0C9; &#xC5D4;&#xC9C4; &#xCD5C;&#xC801;&#xD654;&#xB97C; &#xAC1C;&#xC120;&#xD558;&#xAE30; &#xC704;&#xD574; SSR&#xC744; &#xACE0;&#xB824;&#xD558;&#xB294; &#xC911;&#xC774;&#xB77C;&#xBA74; <strong>&#xC0AC;&#xC804; &#xB80C;&#xB354;&#xB9C1;</strong>&#xC774; &#xB354; &#xC88B;&#xC2B5;&#xB2C8;&#xB2E4;. HTML&#xC744; &#xC989;&#xC11D;&#xC5D0;&#xC11C; &#xCEF4;&#xD30C;&#xC77C;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC6F9; &#xC11C;&#xBC84;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xB300;&#xC2E0; &#xC0AC;&#xC804; &#xB80C;&#xB354;&#xB9C1;&#xC740; &#xBE4C;&#xB4DC;&#xC2DC; &#xD2B9;&#xC815; &#xACBD;&#xB85C;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xC801; HTML &#xD30C;&#xC77C;&#xC744; &#xC0DD;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xC7A5;&#xC810;&#xC740; &#xBBF8;&#xB9AC; &#xB80C;&#xB354;&#xB9C1;&#xC744; &#xC124;&#xC815;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD6E8;&#xC52C; &#xAC04;&#xB2E8;&#xD558;&#xBA70; &#xD504;&#xB860;&#xD2B8; &#xC5D4;&#xB4DC;&#xB97C; &#xC644;&#xC804;&#xD788; &#xC815;&#xC801;&#xC778; &#xC0AC;&#xC774;&#xD2B8;&#xB85C; &#xC720;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>webpack&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0; <a href="https://github.com/chrisvfritz/prerender-spa-plugin" target="_blank">prerender-spa-plugin</a>&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xC0AC;&#xC804; &#xB80C;&#xB354;&#xB9C1;&#xC744; &#xC27D;&#xAC8C; &#xCD94;&#xAC00; &#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. Vue &#xC571;&#xC73C;&#xB85C; &#xAD11;&#xBC94;&#xC704;&#xD558;&#xAC8C; &#xD14C;&#xC2A4;&#xD2B8;&#xB418;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; <a href="https://github.com/chrisvfritz" target="_blank">&#xC81C;&#xC791;&#xC790;</a>&#xB294; Vue &#xD575;&#xC2EC; &#xD300;&#xC758; &#xBA64;&#xBC84;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="&#xC774;-&#xAC00;&#xC774;&#xB4DC;&#xC5D0;-&#xAD00;&#xD558;&#xC5EC;">&#xC774; &#xAC00;&#xC774;&#xB4DC;&#xC5D0; &#xAD00;&#xD558;&#xC5EC;</h2>
<p>&#xC774; &#xC548;&#xB0B4;&#xC11C;&#xB294; Node.js&#xB97C; &#xC11C;&#xBC84;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC11C;&#xBC84; &#xB80C;&#xB354;&#xB9C1; &#xC2F1;&#xAE00; &#xD398;&#xC774;&#xC9C0; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0; &#xC911;&#xC810;&#xC744; &#xB461;&#xB2C8;&#xB2E4;. Vue SSR&#xACFC; &#xB2E4;&#xB978; &#xBC31;&#xC5D4;&#xB4DC; &#xC124;&#xC815;&#xC744; &#xD63C;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#xB2E4;&#xB978; &#xC8FC;&#xC81C;&#xC774;&#xBBC0;&#xB85C; &#xC774; &#xAC00;&#xC774;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xB2E4;&#xB8E8;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xAC00;&#xC774;&#xB4DC;&#xB294; &#xB9E4;&#xC6B0; &#xAE4A;&#xC774; &#xC788;&#xACE0; Vue.js &#xC790;&#xCCB4;&#xC5D0; &#xC774;&#xBBF8; &#xC775;&#xC219;&#xD558;&#xACE0; Node.js&#xC640; webpack&#xC5D0; &#xB300;&#xD55C; &#xC2E4;&#xC81C; &#xC9C0;&#xC2DD;&#xC774; &#xC788;&#xB2E4;&#xACE0; &#xAC00;&#xC815;&#xD569;&#xB2C8;&#xB2E4;. &#xC989;&#xC2DC; &#xC6D0;&#xD65C;&#xD558;&#xAC8C; &#xC0AC;&#xC6A9;&#xD560; &#xC218;&#xC788;&#xB294; &#xB354; &#xB192;&#xC740; &#xC218;&#xC900;&#xC758; &#xC194;&#xB8E8;&#xC158;&#xC744; &#xC6D0;&#xD55C;&#xB2E4;&#xBA74; <a href="http://nuxtjs.org/" target="_blank">Nuxt.js</a>&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xC2ED;&#xC2DC;&#xC624;. &#xB3D9;&#xC77C;&#xD55C; Vue &#xC2A4;&#xD0DD;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C;&#xD558;&#xC9C0;&#xB9CC; &#xB9CE;&#xC740; &#xC0C1;&#xC6A9;&#xAD6C;&#xB97C; &#xCD94;&#xC0C1;&#xD654;&#xD558;&#xACE0; &#xC815;&#xC801; &#xC0AC;&#xC774;&#xD2B8; &#xC0DD;&#xC131;&#xACFC; &#xAC19;&#xC740; &#xBA87; &#xAC00;&#xC9C0; &#xCD94;&#xAC00; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7EC;&#xB098; &#xC571; &#xAD6C;&#xC870;&#xB97C; &#xC9C1;&#xC811; &#xC81C;&#xC5B4;&#xD574;&#xC57C;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xC0AC;&#xC6A9;&#xBC29;&#xC2DD;&#xC774; &#xB9DE;&#xC9C0; &#xC54A;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB7FC;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xC0C1;&#xD669;&#xC774; &#xC5B4;&#xB5BB;&#xAC8C; &#xC791;&#xB3D9;&#xD558;&#xB294;&#xC9C0; &#xB354; &#xC798; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC704;&#xD574; &#xC774; &#xC548;&#xB0B4;&#xC11C;&#xB97C; &#xC77D;&#xB294; &#xAC83;&#xC774; &#xC5EC;&#xC804;&#xD788; &#xC720;&#xC6A9;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xAC00;&#xC774;&#xB4DC;&#xB97C; &#xC77D;&#xC73C;&#xBA74;&#xC11C; &#xAC00;&#xC774;&#xB4DC;&#xAC00; &#xB2E4;&#xB8E8;&#xB294; &#xB300;&#xBD80;&#xBD84;&#xC758; &#xAE30;&#xC220;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; <a href="https://github.com/vuejs/vue-hackernews-2.0/" target="_blank">HackerNews Demo</a>&#xB97C; &#xCC38;&#xC870;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB3C4;&#xC6C0;&#xC774; &#xB420; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C;, &#xC774; &#xAC00;&#xC774;&#xB4DC;&#xB294; &#xC644;&#xBCBD;&#xD558;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC798; &#xC791;&#xB3D9;&#xD558;&#xACE0; &#xC788;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xACE0; &#xC788;&#xC9C0;&#xB9CC; &#xAC1C;&#xC120;&#xD560; &#xC5EC;&#xC9C0;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xAC00;&#xC774;&#xB4DC;&#xB294; &#xC55E;&#xC73C;&#xB85C; &#xAC1C;&#xC815; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD480; &#xB9AC;&#xD018;&#xC2A4;&#xD2B8;&#xB97C; &#xD574;&#xC8FC;&#xC138;&#xC694;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
  <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
  <div class="bsa-cpc"></div>
  <script>
    (function(){
      if(typeof _bsa !== 'undefined' && _bsa) {
      _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
        target: '.bsa-cpc',
        align: 'horizontal',
        disable_css: 'true'
      });
        }
    })();
  </script>

            </div>

            
                
                
                <a href="basic.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 기본 사용 방법">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Introduction","level":"1.1","depth":1,"next":{"title":"기본 사용 방법","level":"1.2","depth":1,"path":"basic.md","ref":"basic.md","articles":[]},"dir":"ltr"},"config":{"plugins":["edit-link","theme-vuejs","-fontsettings","github"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"edit-link":{"label":"Edit This Page","base":"https://github.com/vuejs/vue-ssr-docs/edit/master/"},"github":{"url":"https://github.com/vuejs/vue-ssr-docs/"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-vuejs":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"language":"ko","links":{"sharing":{"facebook":false,"twitter":false}},"gitbook":"*"},"file":{"path":"README.md","mtime":"2017-08-24T05:24:43.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-05-22T06:54:12.163Z"},"basePath":".","book":{"language":"ko"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    

    </body>
</html>

